package ru.gb.lesson2;

public class HomeWork {

    public static void main(String[] args) {
        // [1 2 3 2 1 2 3 4 4 4 2 3 3 1 2 3 4 4 2 1 3 4 2 1 1]
        // 1 -> 5 Единица встречается 5 раз (! ЧИСЛО ВЗЯТО С ПОТОЛКА!)
        // 2 -> 7 Двойка встречается 7 раз
        // 3 -> 3
        // 4 -> 5

        // Вставляем единицу 5 раз, потом двойку 7 раз, потом тройку 3 три раза, потом четверку 5 раз
    }

    /**
     * Реализовать сортировку подсчетом.
     *
     */
    static void countingSort(int[] array) {

    }

}
